Repository: deep-assistant/telegram-bot
Catalog: bot/locales/*/LC_MESSAGES/messages.po
Languages: ru

# hello_text
source: 👋 Hi! I'm a bot from the developers of deep.foundation! 🤖 I'm ready to help you with any task — just send a message or press a menu button! /help - ✨ overview of commands and features /balance - ⚡️ check your balance /referral - 🔗 referral program details Everything is free unless you pay. Every day your balance will be topped up by *10 000⚡️* (energy)! Need more? 💎 Top up your balance with Telegram Stars or a bank card. 👥 Enjoy the bot? Share it with friends and get a bonus for each one you invite! Bring lots of friends and you'll be able to use neural networks almost without limits. /referral - earn more with the referral system: *5 000⚡️* for each invited user; *+500⚡️* to the daily top-up for each friend. 🏠 If something went wrong or you’d like to share inspiration, write to our community @deepGPT.
ru: 👋 Привет! Я бот от разработчиков deep.foundation! 🤖 Я готов помочь тебе с любой задачей, просто напиши сообщение или нажми кнопку в меню! /help - ✨ обзор команд и возможностей /balance - ⚡️ узнать свой баланс /referral - 🔗 подробности рефералки Всё бесплатно, если не платить. Каждый день твой баланс будет пополняться на сумму от *10 000⚡️* (энергии)! Если нужно больше: 💎 Можно пополнить баланс Telegram звёздами или банковской картой. 👥 Понравилось? Поделись с друзьями и получи бонус за каждого приглашенного друга! Приводя много друзей ты сможешь пользоваться нейросетями практически безлимитно. /referral - получай больше с реферальной системой: *5 000⚡️️* за каждого приглашенного пользователя; *+500⚡️️* к ежедневному пополнению баланса за каждого друга. 🏠 Если что-то пошло не так или хочешь поделиться вдохновением, напиши в наше сообщество @deepGPT.

# ref_text
source: 👋 You came via a referral link. To claim your reward, please subscribe to my channel.
ru: 👋 Ты прибыл по реферальной ссылке, чтобы получить награду нужно подписаться на мой канал.

# referral_reward_user
source: 🎉 You received *5 000*⚡️! /balance - ✨ Check balance /referral - 🔗 Referral details
ru: 🎉 Вы получили *5 000*⚡️! /balance - ✨ Узнать баланс /referral - 🔗 Подробности рефералки

# referral_reward_parent
source: 🎉 A new referral has been added! You received *5 000*⚡️! Your referral must do any activity in the bot within 24 h for you to get another *5 000*⚡️ and +500⚡️ to your daily top-up. /balance - ✨ Check balance /referral - 🔗 Referral details
ru: 🎉 Добавлен новый реферал! Вы получили *5 000*⚡️! Ваш реферал должен проявить любую активность в боте через 24 часа, чтобы вы получили еще *5 000*⚡️ и +500⚡️️ к ежедневному пополнению баланса. /balance - ✨ Узнать баланс /referral - 🔗 Подробности рефералки

# subscribe_button
source: Subscribe 👊🏻
ru: Подписаться 👊🏻

# check_button
source: Check ✅
ru: Проверить ✅

# not_subscribed
source: You haven't subscribed! 😡
ru: Вы не подписались! 😡

source: ❌ Invalid referral ID.
ru: ❌ Некорректный реферальный ID.

# help_text
source: The main resource for accessing neural networks is ⚡️ (energy) — a universal resource for all bot functions. Each neural network consumes a different amount of ⚡️. The cost depends on dialog history length, chosen models, and the size of your questions and the network’s answers. To save ⚡️, use /clear so the dialog history doesn’t overflow and increase consumption! It’s recommended to clear the context before starting a new topic and also if the selected model starts refusing to help. /app - 🔥 Get the application link! /start - 🔄 Restart the bot to update to the latest version. /model - 🛠️ Switch the model. /system - ⚙️ System message to change the interaction mode. /clear - 🧹 Clear the context. /balance - ✨ Balance. /image - 🖼️ Image generation (Midjourney, DALL·E 3, Flux, Stable Diffusion) /buy - 💎 Top up the balance. /referral - 🔗 Get a referral link /suno - 🎵 Music generation (Suno) /text - Send a text message
ru: Основной ресурc для доступа к нейросетям - ⚡️ (энергия). Это универсальный ресурс для всего функционала бота. Каждая нейросеть тратит разное количество ⚡️. Количество затраченных ⚡️ зависит от длины истории диалога, моделей нейросетей и объёма ваших вопросов и ответов от нейросети. Для экономии используйте команду - /clear, чтобы не переполнять историю диалога и не увеличивать расход ⚡️ (энергии)! Рекомендуется очищать контекст перед началом обсуждения новой темы. А также если выбранная модель начала отказывать в помощи. /app - 🔥 Получить ссылку к приложению! /start - 🔄 Рестарт бота, перезапускает бот, помогает обновить бота до последней версии. /model - 🛠️ Сменить модель, перезапускает бот, позволяет сменить модель бота. /system - ⚙️ Системное сообщение, позволяет сменить системное сообщение, чтобы изменить режим взаимодействия с ботом. /clear - 🧹 Очистить контекст, помогает забыть боту всю историю. /balance - ✨ Баланс, позволяет узнать баланс ⚡️. /image - 🖼️ Генерация картинки (Midjourney, DALL·E 3, Flux, Stable Diffusion) /buy - 💎 Пополнить баланс, позволяет пополнить баланс ⚡️. /referral - 🔗 Получить реферальную ссылку /suno - 🎵 Генерация музыки (Suno) /text - Отправить текстовое сообщение

# app_link
source: Application link: https://t.me/DeepGPTBot/DeepGPT
ru: Ссылка на приложение: https://t.me/DeepGPTBot/DeepGPT
