DEFAULT_ERROR_MESSAGE = """Что-то пошло не так 😔
Пожалуйста попробуйте ещё раз или позже.
Можно так же попробовать другой промт.
Если проблема повторяется, то убедитесь:
1. что вы перезапускали бота (/start) 
2. что ваш контекст сборшен (/clear).
Если и это не помогает, пожалуйста, обратитесь в поддержку (@deepGPT)."""

GENERATION_FAILED_DEFAULT_ERROR_MESSAGE = """Генерация не удалась. Что-то пошло не так 😔
Пожалуйста попробуйте ещё раз или позже.
Можно так же попробовать другой промт.
Если проблема повторяется, то убедитесь:
1. что вы перезапускали бота (/start) 
2. что ваш контекст сборшен (/clear).
Если и это не помогает, пожалуйста, обратитесь в поддержку (@deepGPT)."""

DIALOG_CONTEXT_CLEAR_FAILED_DEFAULT_ERROR_MESSAGE = """Не удалось очистить контекст. 😔 Пожалуйста, попробуйте ещё раз!

Если проблема повторяется, напишите нам в чат сообщества (@deepGPT) в раздел *Ошибки*."""