DEFAULT_ERROR_MESSAGE = """Что-то пошло не так. 😔 Пожалуйста, попробуйте ещё раз! 

Если проблема повторяется, напишите нам в чат сообщества (@deepGPT) в раздел *Ошибки*."""

GENERATION_FAILED_DEFAULT_ERROR_MESSAGE = """Генерация не удалась. Что-то пошло не так. 😔 Пожалуйста, попробуйте ещё раз! 

Если проблема повторяется, напишите нам в чат сообщества (@deepGPT) в раздел *Ошибки*."""

DIALOG_CONTEXT_CLEAR_FAILED_DEFAULT_ERROR_MESSAGE = """Не удалось очистить контекст. 😔 Пожалуйста, попробуйте ещё раз!

Если проблема повторяется, напишите нам в чат сообщества (@deepGPT) в раздел *Ошибки*."""